{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"arguments": {}, "batch_input_shape": [null, 200, 66, 3], "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "name": "Normalization", "function_type": "lambda", "output_shape_type": "raw", "output_shape": null}}, {"class_name": "Convolution2D", "config": {"bias": true, "border_mode": "valid", "nb_col": 5, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "nb_filter": 24, "init": "glorot_uniform", "dim_ordering": "tf", "name": "Conv1", "trainable": true, "activation": "relu", "b_constraint": null, "nb_row": 5, "b_regularizer": null, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"bias": true, "border_mode": "valid", "nb_col": 5, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "nb_filter": 36, "init": "glorot_uniform", "dim_ordering": "tf", "name": "Conv2", "trainable": true, "activation": "relu", "b_constraint": null, "nb_row": 5, "b_regularizer": null, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"bias": true, "border_mode": "valid", "nb_col": 5, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "nb_filter": 48, "init": "glorot_uniform", "dim_ordering": "tf", "name": "Conv3", "trainable": true, "activation": "relu", "b_constraint": null, "nb_row": 5, "b_regularizer": null, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"bias": true, "border_mode": "valid", "nb_col": 3, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "dim_ordering": "tf", "name": "Conv4", "trainable": true, "activation": "relu", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "config": {"bias": true, "border_mode": "valid", "nb_col": 3, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "dim_ordering": "tf", "name": "Conv5", "trainable": true, "activation": "relu", "b_constraint": null, "nb_row": 3, "b_regularizer": null, "subsample": [1, 1]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "trainable": true, "output_dim": 1164, "input_dim": null, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "name": "FC1", "W_regularizer": null, "activation": "relu", "b_regularizer": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Dense", "config": {"b_constraint": null, "trainable": true, "output_dim": 100, "input_dim": null, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "name": "FC2", "W_regularizer": null, "activation": "relu", "b_regularizer": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.2}}, {"class_name": "Dense", "config": {"b_constraint": null, "trainable": true, "output_dim": 50, "input_dim": null, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "name": "FC3", "W_regularizer": null, "activation": "relu", "b_regularizer": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.2}}, {"class_name": "Dense", "config": {"b_constraint": null, "trainable": true, "output_dim": 10, "input_dim": null, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "name": "FC4", "W_regularizer": null, "activation": "relu", "b_regularizer": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.2}}, {"class_name": "Dense", "config": {"b_constraint": null, "trainable": true, "output_dim": 1, "input_dim": null, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "name": "output", "W_regularizer": null, "activation": "linear", "b_regularizer": null, "bias": true}}]}