{"keras_version": "1.1.2", "config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>b\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "trainable": true, "name": "Normalization", "output_shape": null, "batch_input_shape": [null, 200, 66, 3], "output_shape_type": "raw", "function_type": "lambda", "arguments": {}}, "class_name": "Lambda"}, {"config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "nb_filter": 24, "nb_col": 5, "name": "Conv1", "bias": true, "activity_regularizer": null, "border_mode": "valid", "activation": "relu", "subsample": [2, 2], "trainable": true, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "nb_filter": 36, "nb_col": 5, "name": "Conv2", "bias": true, "activity_regularizer": null, "border_mode": "valid", "activation": "relu", "subsample": [2, 2], "trainable": true, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "nb_filter": 48, "nb_col": 5, "name": "Conv3", "bias": true, "activity_regularizer": null, "border_mode": "valid", "activation": "relu", "subsample": [2, 2], "trainable": true, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 64, "nb_col": 3, "name": "Conv4", "bias": true, "activity_regularizer": null, "border_mode": "valid", "activation": "relu", "subsample": [1, 1], "trainable": true, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"b_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_filter": 64, "nb_col": 3, "name": "Conv5", "bias": true, "activity_regularizer": null, "border_mode": "valid", "activation": "relu", "subsample": [1, 1], "trainable": true, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"input_dim": null, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "name": "FC1", "bias": true, "activity_regularizer": null, "output_dim": 1164, "trainable": true, "W_constraint": null, "b_constraint": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"input_dim": null, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "name": "FC2", "bias": true, "activity_regularizer": null, "output_dim": 100, "trainable": true, "W_constraint": null, "b_constraint": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"input_dim": null, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "name": "FC3", "bias": true, "activity_regularizer": null, "output_dim": 50, "trainable": true, "W_constraint": null, "b_constraint": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"input_dim": null, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "name": "FC4", "bias": true, "activity_regularizer": null, "output_dim": 10, "trainable": true, "W_constraint": null, "b_constraint": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"name": "dropout_4", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"input_dim": null, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "name": "output", "bias": true, "activity_regularizer": null, "output_dim": 1, "trainable": true, "W_constraint": null, "b_constraint": null, "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential"}