{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "name": "Normalization", "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\btrain.py\u00da\b<lambda>8\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "trainable": true, "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "nb_col": 5, "b_constraint": null, "trainable": true, "activation": "relu", "dim_ordering": "tf", "name": "Conv1", "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 24, "subsample": [2, 2], "nb_row": 5, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "nb_col": 5, "b_constraint": null, "trainable": true, "activation": "relu", "dim_ordering": "tf", "name": "Conv2", "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 36, "subsample": [2, 2], "nb_row": 5, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "nb_col": 5, "b_constraint": null, "trainable": true, "activation": "relu", "dim_ordering": "tf", "name": "Conv3", "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 48, "subsample": [2, 2], "nb_row": 5, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "nb_col": 3, "b_constraint": null, "trainable": true, "activation": "relu", "dim_ordering": "tf", "name": "Conv4", "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "subsample": [1, 1], "nb_row": 3, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "W_constraint": null, "bias": true, "activity_regularizer": null, "nb_col": 3, "b_constraint": null, "trainable": true, "activation": "relu", "dim_ordering": "tf", "name": "Conv5", "b_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "subsample": [1, 1], "nb_row": 3, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "input_dim": null, "output_dim": 1164, "bias": true, "activity_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "name": "FC1", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "input_dim": null, "output_dim": 100, "bias": true, "activity_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "name": "FC2", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "input_dim": null, "output_dim": 50, "bias": true, "activity_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "name": "FC3", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "input_dim": null, "output_dim": 10, "bias": true, "activity_regularizer": null, "b_constraint": null, "trainable": true, "activation": "relu", "name": "FC4", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "input_dim": null, "output_dim": 1, "bias": true, "activity_regularizer": null, "b_constraint": null, "trainable": true, "activation": "linear", "name": "output", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null}}]}